** Buffers
   | :-------- | :----------------------- |
   | BUffer    | Descripcion              |
   | --------- | ------------------------ |
   | backtrace | Es el depurador de emacs |
   | scratch   | Para depurar codigo lisp    |

   Algunas diferencias:
   - Con setq y setf podemos cambiar el valor a las variables, pero el primero es de mas bajo nivel
     que setf. Este segundo es de mas alto nivel, e incorpora dentro a setq.
   - Con setq no podemos cambiar el valor de una lista

   #+BEGIN_SRC lisp
     ;; Correr cada linea con M-x  C-x C-e   

     ;; ejecuto una funcion prefija
     (+ 1 2)

     ;; declaro una variable local y le asigno una lista
     (setq dias '(lunes martes))
     (setq letras '(A B C))

     ;; declaro una variable global
     (setf dias '(lunes martes))

     ;; pido el primer elemento de la lista (a b c)
     (first '(a b c)

            ;; imprimo la variable dias
            (print dias)

            ;; Le cambio el valor del primer elemento a una lista
            ;; si probara con setq devolveria error
            (setf (first dias) 'viernes)
            (print dias) ;; ahora deberia devolver (viernes martes)

            ;; Creo una funcion last (le resto 1 para no excederme de la cantidad de elementos)
            (nth (- (length dias) 1) dias)

            ;; Une dos listas en una
            (append '(a b) '(c d))
            ;; Insertamos una sublista al principio de otra lista
            (cons '(a b) '(c d))

            ;; Creo una funcion que imprima el argumento
            (defun saludo(mensaje)
              (print mensaje)
              )
   #+END_SRC


#+BEGIN_SRC elisp :results raw 
  (defvar nombre "jorgito")

  (print nombre)
#+END_SRC

#+RESULTS:
jorgito

